## Question-1

In this question, we will use the csv file **bank.csv**. 
- a. Read it into a data frame, call it `df`. (Import the packages you think you need).
- b. Drop the following columns:
    ['default','poutcome','y','housing','contact','day','month','duration','campaign','pdays','previous']

In [1]:
#### (a) Your code here
import pandas as pd
import numpy as np

df = pd.read_csv('bank.csv', sep=';')

In [2]:
#### (b) Your code here

df = df.drop(['default','poutcome','y','housing','contact','day','month','duration','campaign','pdays','previous'], axis = 1)

## Question-2
Try to discover this data:
- a. Find the number of rows and columns.
- b. Find the data type of each one of the columns.
- c. Find the total number of missing values and the number of missing values in each column if any (Note that "unknown" is considerd as missing value).
- d. Replace all missing values with the most common value in each columns 
- e. Find all unique values of each categorical column.
- f. Find the mean, min, max of each numerical column.

In [3]:
#### (a) Your code here
rows, columns = df.shape

print("Rows:", rows, "Columns:", columns)

Rows: 45211 Columns: 6

In [4]:
#### (b) Your code here
df.dtypes

age           int64
job          object
marital      object
education    object
balance       int64
loan         object
dtype: object

In [5]:
#### (c) Your code here
df = df.replace("unknown", pd.NA)

total = df.isna().sum().sum()
perCol = df.isna().sum()

In [6]:
#### (d) Your code here
for col in df.columns:
    df[col] = df[col].fillna(df[col].mode()[0])

In [7]:
#### (e) Your code here
for col in ['job', 'marital', 'education', 'loan']:
    print(df[col].unique())

['management' 'technician' 'entrepreneur' 'blue-collar' 'retired' 'admin.'
 'services' 'self-employed' 'unemployed' 'housemaid' 'student']
['married' 'single' 'divorced']
['tertiary' 'secondary' 'primary']
['no' 'yes']

In [8]:
#### (f) Your code here
for col in ['age', 'balance']:
    print(col.title() + ":")
    print("Max:", df[col].max(), "Min:", df[col].min(), "Mean:", df[col].mean())

Age:
Max: 95 Min: 18 Mean: 40.93621021432837
Balance:
Max: 102127 Min: -8019 Mean: 1362.2720576850766

## Question-3

- a. We learned that there is one more record. Add the information of the following record to the DataFrame:
        0,42,management,married,secondary,3266,no
- b. Verify that the new record was added to the end of the dataframe
- c. Drop all rows where education is primary.
- d. Reset the index and remove the new created column (index)

In [9]:
#### (a) Your code here

needed = '42,management,married,secondary,3266,no'
adding = needed.split(',')
adding[0] = float(adding[0])
adding[-2] = float(adding[-2])


df.loc[len(df)] = adding


df

        age           job   marital  education  balance loan
0      58.0    management   married   tertiary   2143.0   no
1      44.0    technician    single  secondary     29.0   no
2      33.0  entrepreneur   married  secondary      2.0  yes
3      47.0   blue-collar   married  secondary   1506.0   no
4      33.0   blue-collar    single  secondary      1.0   no
...     ...           ...       ...        ...      ...  ...
45207  71.0       retired  divorced    primary   1729.0   no
45208  72.0       retired   married  secondary   5715.0   no
45209  57.0   blue-collar   married  secondary    668.0   no
45210  37.0  entrepreneur   married  secondary   2971.0   no
45211  42.0    management   married  secondary   3266.0   no

[45212 rows x 6 columns]

In [10]:
#### (b) Your code here

df.iloc[-1, :]

age                42.0
job          management
marital         married
education     secondary
balance          3266.0
loan                 no
Name: 45211, dtype: object

In [11]:
#### (c) Your code here

df = df.loc[df['education'] != 'primary']

In [12]:
#### (d) Your code here

df.reset_index()
df

        age           job  marital  education  balance loan
0      58.0    management  married   tertiary   2143.0   no
1      44.0    technician   single  secondary     29.0   no
2      33.0  entrepreneur  married  secondary      2.0  yes
3      47.0   blue-collar  married  secondary   1506.0   no
4      33.0   blue-collar   single  secondary      1.0   no
...     ...           ...      ...        ...      ...  ...
45206  51.0    technician  married   tertiary    825.0   no
45208  72.0       retired  married  secondary   5715.0   no
45209  57.0   blue-collar  married  secondary    668.0   no
45210  37.0  entrepreneur  married  secondary   2971.0   no
45211  42.0    management  married  secondary   3266.0   no

[38361 rows x 6 columns]

## Question-4

- a. Find the number of people of 'secondary' education level.
- b. Compare between the average of the balance of married and single people
- c. Find the mean and the standard deviation of the balance of each education level.
- d. Find the mean and the standard deviation of the balance of each job.
- e. What is the average balance for different education groups and marital status?
- f. Compare between the number of people who had loan (married vs single)
- g. Which job has the lowest mean balance?
- h. Which job has the highest number of loans?

In [13]:
#### (a) Your code here

df.loc[df['education'] == 'secondary'].shape[0]

25060

In [14]:
#### (b) Your code here

df[['marital', 'balance']].groupby('marital').mean()

              balance
marital
divorced  1185.825365
married   1459.265784
single    1313.665745

In [15]:
#### (c) Your code here

df[['education', 'balance']].groupby('education').agg(['mean', 'std'])

               balance
                  mean          std
education
secondary  1182.521668  2608.646435
tertiary   1758.416435  3839.088305

In [16]:
#### (d) Your code here

df[['job', 'balance']].groupby('job').agg(['mean', 'std'])

                   balance
                      mean          std
job
admin.         1144.488714  2673.269119
blue-collar    1101.068588  2241.948530
entrepreneur   1499.311350  4052.855186
housemaid      1662.561175  3595.206174
management     1766.711839  3843.539170
retired        2040.860449  4557.834171
self-employed  1676.433402  3792.758504
services        999.852192  2194.894642
student        1395.174497  2470.152290
technician     1247.649550  2549.988593
unemployed     1505.420650  3233.733642

In [17]:
#### (e) Your code here

df[['education', 'balance', 'marital']].groupby(['education', 'marital']).agg(['mean', 'std'])

                        balance
                           mean          std
education marital
secondary divorced   931.904491  2086.454569
          married   1275.661443  2808.005958
          single    1092.552694  2349.776272
tertiary  divorced  1700.917063  4252.286797
          married   1848.779341  3937.521135
          single    1643.351210  3545.187122

In [27]:
#### (f) Your code here

df[['loan', 'marital']].groupby(['marital']).apply(lambda x: (x['loan'] == 'yes').sum())

/var/folders/kx/58cjbwzx5jjgn5w_sjz3qk0w0000gn/T/ipykernel_28239/2380327563.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df[['loan', 'marital']].groupby(['marital']).apply(lambda x: (x['loan'] == 'yes').sum())

marital
divorced     821
married     3844
single      1555
dtype: int64

In [25]:
#### (g) Your code here

df[['job', 'balance']].groupby('job').mean().idxmin()[0]

/var/folders/kx/58cjbwzx5jjgn5w_sjz3qk0w0000gn/T/ipykernel_28239/3674948425.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df[['job', 'balance']].groupby('job').mean().idxmin()[0]

'services'

In [28]:
#### (h) Your code here

df[['education', 'balance', 'marital']].groupby(['education', 'marital']).agg(['mean', 'std']).idxmax()

balance  mean     (tertiary, married)
         std     (tertiary, divorced)
dtype: object